<template>
    <div class="popup-warpper">
        <Overlay />
        <div class="content">
            <div class="cell-body">
                <h4>活动1</h4>
                <div class="group">
                    一、活动期限：<br />
                    2022年5月26日至2022年6月2日
                </div>

                <div class="group">
                    二、活动内容：<br />
                    1、规则内容<br />
                    <p>1.1、奖励筹款项目以活动时间为准。</p>
                    <p>
                        1.2、活动期内，凡参与活动的筹款项目已筹款金额达到10000元金额时，该筹款项目即可获得轻松筹平台一次性补贴的2000元特殊奖励金。
                    </p>
                    <p>
                        1.3、参与活动的筹款项目，在活动期间内，统计其已筹款金额是否满足活动规则，期限届满。活动结束后的捐款金额不计入到已筹款金额内。
                    </p>
                    <p>1.4、每个参与本活动的筹款项目只有一次获得2000元特殊奖励金的机会。</p>
                    <p>1.5、如用户的捐助金额被退回或部分退回的，则该部分金额不计入“已筹款金额”。</p>
                    <p>1.6、同一被救助人（患者）只能获得一个筹款项目奖励金。</p>
                </div>

                <div class="group">
                    三、违规行为处理：<br />
                    1、本活动仅限符合规则要求的用户参与。一旦发现用户采取刷单、虚假赠与、作弊等其他不符合规则的方式参加活动，轻松筹有权取消其参与活动的资格，终止活动奖励，并追回已经发放的奖励金。
                </div>

                <div class="group">
                    四、奖励金发放方式<br />
                    参与本活动的筹款项目，需要在申请提现前，按照相关规定补全证明材料。在证明材料齐全且审核通过后，奖励金将在筹款项目结束，且所筹款项全部提现完成后的30个工作日内，自动打入筹款项目的个人提现账户。<br />
                </div>

                <div class="group">
                    五、其他<br />
                    1、如果出现网络攻击、黑客攻击、数据泄露、疫情、政府要求等原因导致活动无法继续，轻松筹有权利提前终止本活动。<br />
                    2、若对本活动规则有任何疑问，可拨打客服热线<a :tel="10101019">10101019</a
                    >咨询。<br />
                    3、用户参加本活动不需向轻松筹支付任何费用。如有任何人要求用户支付费用的，请及时向轻松筹举报。<br />
                    4、参与本活动，需要同时遵守轻松筹对于发起个人大病求助项目的各项要求。
                </div>
                <br />

                <h4>活动2</h4>
                <div class="group">
                    一、活动形式：<br />
                    在活动期间内，爱心用户可以通过以下活动规定的方式获得“爱心”。
                </div>
                <div class="group">
                    二、爱心获取方式：<br />
                    1、活动期间每日签到可获得“爱心”。<br />
                    2、活动期间浏览配捐或公益界面可得1颗“爱心”。<br />
                    3、活动期间成功捐款可获得1颗“爱心”，可进行多次复捐。<br />
                    4、活动期间捐款成功后进行分享后可获得1颗“爱心”。<br />
                    5、活动期间成功转发活动可得1颗“爱心”。<br />
                    6、活动期间成功邀请好友后可得1颗“爱心”<br />
                </div>

                <div class="group">
                    三、奖励获取条件：公益证书&勋章：<br />
                    1、累计获得50颗爱心，点亮轻松筹爱心关怀勋章，获得轻松筹微爱公益基金会颁发的爱心传递大使电子证书<br />
                    2、助力捐款15次配捐项目，点亮轻松筹儿童守护大使勋章，获得轻松筹微爱公益基金会颁发的儿童守护大使电子证书<br />
                    3、成功登录5天完成签到领取，点亮轻松筹仁爱公益大使勋章，获得轻松筹微爱公益基金会颁发的仁爱公益大使电子证书
                </div>
            </div>
        </div>
    </div>
</template>

<script lang="ts" setup></script>

<style lang="scss" scoped>
.popup-warpper {
    position: relative;
}

.content {
    width: 80%;
    background: #fff;
}

.content {
    position: fixed;
    top: 0;
    left: 0;
    width: 100%;
    height: auto;
    z-index: 2;
}

.cell-body {
    height: 300px;
    overflow: hidden;
    overflow-y: scroll;
    margin-bottom: 20px;
}
</style>
